astb_relise/src/Catalogs/НормыВыдачиСИЗ/НормыВыдачиСИЗ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>НормыВыдачиСИЗ</name>
  <owners>Catalog.Организации</owners>
  <attributes>
    <name>ВидВыдачиСИЗ</name>
    <type>
      <types>EnumRef.ВидыВыдачиСИЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>ОснованиеНормы</name>
    <type>
      <types>CatalogRef.ПунктыТОН</types>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидРасчета</name>
    <type>
      <types>EnumRef.ВидыРасчетаНорм</types>
    </type>
  </attributes>
  <attributes>
    <name>ВесовойКоэффициент</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>СоставНормы</name>
    <comment>Состав нормы (группа &quot;ИЛИ&quot;)</comment>
    <attributes>
      <name>НоменклатураНормы</name>
      <type>
        <types>CatalogRef.НоменклатураНормОрганизации</types>
      </type>
    </attributes>
    <attributes>
      <name>ЕдиницаИзмерения</name>
      <type>
        <types>CatalogRef.ЕдиницыИзмерения</types>
      </type>
    </attributes>
    <attributes>
      <name>ПериодичностьВыдачи</name>
      <type>
        <types>CatalogRef.ПериодичностьВыдачиСИЗ</types>
      </type>
    </attributes>
    <attributes>
      <name>ГОСТ</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>200</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>УчитыватьВПотребности</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ПериодичностьДляЛичнойКарточки</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

astb_relise/src/Catalogs/НормыВыдачиСИЗ/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
Функция СформироватьМассивНаименованийНормыВыдачиСИЗ(ТекущийОбъект) Экспорт
	
	МассивНаименований = Новый Массив;
	
	ВспомогательнаяТаблица = Новый ТаблицаЗначений;
	ВспомогательнаяТаблица.Колонки.Добавить("ВариантНаименования");
	ВспомогательнаяТаблица.Колонки.Добавить("НомерСтрокиСостава");
	
	Для Каждого СтрокаСостава Из ТекущийОбъект.СоставНормы Цикл
		
		МассивСловНаименования 	= УправлениеКонтактнойИнформациейКлиентСервер.СловаТекста(СокрЛП(СтрокаСостава.НоменклатураНормы.Наименование)," ");
		
		ТекущаяПериодичность 	= ?(ЗначениеЗаполнено(СтрокаСостава.ПериодичностьВыдачи)," (" + СокрЛП(СтрокаСостава.ПериодичностьВыдачи.Наименование) + ") "," (" + ТекущийОбъект.ВидРасчета + ") ");
		
		ТекущееНаименование = "";
		
		Для Каждого ЭлементМассива Из МассивСловНаименования Цикл
			
			Если НЕ ЗначениеЗаполнено(ЭлементМассива) Тогда
				Продолжить;
			КонецЕсли;
			
		    ТекущееНаименование = ТекущееНаименование + " " + ЭлементМассива;
			
			Если СтрДлина(ТекущееНаименование) > 150 Тогда
				Продолжить;
			КонецЕсли;	
			
			НоваяСтрока 					= ВспомогательнаяТаблица.Добавить();
			НоваяСтрока.ВариантНаименования = СокрЛП(ТекущееНаименование + ТекущаяПериодичность);
			НоваяСтрока.НомерСтрокиСостава 	= СтрокаСостава.НомерСтроки;
			
		КонецЦикла;
		
	КонецЦикла;
	
	СтруктураПоиска = Новый Структура("НомерСтрокиСостава",1);
	
	НайденныеСтроки = ВспомогательнаяТаблица.НайтиСтроки(СтруктураПоиска);
	
	Для Каждого НайденнаяСтрока Из НайденныеСтроки Цикл 
		
		ТекущееНаименование = НайденнаяСтрока.ВариантНаименования;
		
		Если ТекущийОбъект.СоставНормы.Количество() <= 1 Тогда
		
		    МассивНаименований.Добавить(ТекущееНаименование);
			
		Иначе
			
			РекурсияПоНомеруСтроки(ТекущееНаименование + " или ",2,ВспомогательнаяТаблица,ТекущийОбъект.СоставНормы.Количество(),МассивНаименований);
			
		КонецЕсли;
		
	КонецЦикла;
	
	//если массив пустой, надо хоть что-нибудь добавить
	Если МассивНаименований.Количество() = 0 Тогда
		
		ТекущаяПериодичность = ?(ЗначениеЗаполнено(ТекущийОбъект.СоставНормы[0].ПериодичностьВыдачи)," (" + СокрЛП(ТекущийОбъект.СоставНормы[0].ПериодичностьВыдачи.Наименование) + ") "," (" + ТекущийОбъект.ВидРасчета + ") ");
		
		МассивНаименований.Добавить(СокрЛП(ТекущийОбъект.СоставНормы[0].НоменклатураНормы.Наименование) + ТекущаяПериодичность);
			
	КонецЕсли;
	
	Возврат МассивНаименований;
	
КонецФункции	
	
Процедура РекурсияПоНомеруСтроки(ВходящееНаименование,НомерСтроки,ВспомогательнаяТаблица,КоличествоСтрокСостава,МассивНаименований)	
	
	СтруктураПоиска = Новый Структура("НомерСтрокиСостава",НомерСтроки);
	
	НайденныеСтроки = ВспомогательнаяТаблица.НайтиСтроки(СтруктураПоиска);
	
	Для Каждого НайденнаяСтрока Из НайденныеСтроки Цикл 
		
		ТекущееНаименование = ВходящееНаименование + НайденнаяСтрока.ВариантНаименования;
		
		Если СтрДлина(ТекущееНаименование) > 150 Тогда
			Продолжить;
		КонецЕсли;
		
		Если КоличествоСтрокСостава <= НомерСтроки Тогда
		
		    МассивНаименований.Добавить(ТекущееНаименование);
			
		Иначе
			
			РекурсияПоНомеруСтроки(ТекущееНаименование + " или ",НомерСтроки + 1,ВспомогательнаяТаблица,КоличествоСтрокСостава,МассивНаименований);
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры
	
#КонецЕсли
